Процедура ПроверитьЗаказНаСайте(Форма,ВыполнитьПолучитьВесЗавершение=Ложь) Экспорт
	Если ЗначениеЗаполнено(Форма.Объект.Order) Тогда
		
		Форма.Доступность = Ложь;
		Параметры = Новый Структура;
		Параметры.Вставить("ВыполнитьПолучитьВесЗавершение", ВыполнитьПолучитьВесЗавершение);
		Параметры.Вставить("Форма" , Форма);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьЗаказ_Завершение", ЭтотОбъект,Параметры);
		
		
	Иначе
		
	КонецЕсли;		
КонецПроцедуры
//==========Вынести в отдельную процедуру========
//
//Список аргументов зависит от контекста вызова!
//&НаКлиенте
Процедура ПроверитьЗаказ_Завершение(ДополнительныеПараметры) Экспорт
	
КонецПроцедуры
Процедура ПолучитьРезультатНаСервере()
КонецПроцедуры

	