// Получает вес с электронных весов для табличной части.
//
//
Процедура ПолучениеВГХСлектронныхВесов(Форма,ИмяКоманды,ИмяТабличнойЧасти, ВыполнитьПолучитьВесЗавершение = Истина) Экспорт
	// Проверим текущую строку табличной части.
	Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		
		ТекущаяСтрока = Форма.Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
		Если ТекущаяСтрока = Неопределено Тогда
			ТекстСообщения = НСтр("ru='Необходимо выбрать строку, для которой необходимо получить вес.';uk='Необхідно вибрати рядок, для якого необхідно одержати вагу.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			Форма.Доступность = Ложь;
			
			Параметры = Новый Структура;
			Параметры.Вставить("ВыполнитьПолучитьВесЗавершение", ВыполнитьПолучитьВесЗавершение);
			Параметры.Вставить("ТекущаяСтрока" , ТекущаяСтрока);
			Параметры.Вставить("ИмяКоманды"    ,ИмяКоманды);
			Параметры.Вставить("Форма"         , Форма);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеВГХСлектронныхВесовЗавершение", ЭтотОбъект, Параметры);
			МенеджерОборудованияКлиент.НачатьПолученияВГХСЭлектронныхВесов(ОписаниеОповещения, Форма.УникальныйИдентификатор,(Форма.ТекущееУстройство) , Ложь);
		КонецЕсли;
	Иначе
		Форма.Доступность = Ложь;
		Параметры = Новый Структура;
		Параметры.Вставить("ВыполнитьПолучитьВесЗавершение", ВыполнитьПолучитьВесЗавершение);
		Параметры.Вставить("ТекущаяСтрока" , ТекущаяСтрока);
		Параметры.Вставить("Форма"         , Форма);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеВГХСлектронныхВесовЗавершение", ЭтотОбъект, Параметры);
		МенеджерОборудованияКлиент.НачатьПолученияВГХСЭлектронныхВесов(ОписаниеОповещения, Форма.УникальныйИдентификатор,(Форма.ТекущееУстройство) , Ложь);
		
	КонецЕсли;

	

КонецПроцедуры // ()
// Получает вес с электронных весов для табличной части - завершение.
//    
Процедура ПолучениеВГХСлектронныхВесовЗавершение(РезультатОперации, Параметры) Экспорт
	
	Параметры.Форма.Доступность = Истина;
	
	Если РезультатОперации.Результат Тогда
		
		Параметры.ТекущаяСтрока.seat_width = РезультатОперации.Вес;
		
		Если Параметры.ВыполнитьПолучитьВесЗавершение Тогда
			Параметры.Форма.ПолучитьВесЗавершение(Параметры.ТекущаяСтрока);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры


// Выполнение команды Устройства ВГХ.
//
//
Процедура ВыполнитКомандуНаУстройстве(Форма,Команда,ИдентификаторУстройства) Экспорт 
	Если НЕ ПустаяСтрока(Команда) Тогда
		Форма.Доступность = Ложь;
		
		Параметры = Новый Структура;
		Параметры.Вставить("ВыполнитьПолучитьВесЗавершение", Истина);
		Параметры.Вставить("ИмяКоманды" , Команда);
		Параметры.Вставить("РезультатКоманды" , Форма.РезультатКоманды);
		Параметры.Вставить("Форма"         , Форма);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьКомандуНаУстройствеЗавершение", ЭтотОбъект, Параметры);
		МенеджерОборудованияКлиент.НачатьПолученияВГХСЭлектронныхВесов(ОписаниеОповещения, Форма.УникальныйИдентификатор,(Форма.ТекущееУстройство) , Ложь);
	КонецЕсли;	
КонецПроцедуры
Процедура ВыполнитьКомандуНаУстройствеЗавершение(РезультатОперации,Параметры)
	Параметры.Форма.Доступность = Истина;
	Если РезультатОперации.Результат Тогда
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОперации.ОписаниеОшибки);
	КонецЕсли;
		
КонецПроцедуры




 