

////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Устройство") Тогда
		ТекущееУстройство=Параметры.Устройство;
		ПараметрыПодключения=ТекущееУстройство.Параметры.Получить();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Получить_размерX(Команда)
	// Вставить содержимое обработчика.
	ОчиститьСообщения();

	РезультатКоманды="";
	ИмяКоманды="outSizeX";
	ОтключитьУстройство=Истина;
	ВыходныеПараметры=Новый Массив;
	Получить_ВГХ(ИмяКоманды,ВыходныеПараметры,ОтключитьУстройство);
	Если НЕ ОтключитьУстройство Тогда
		
	КонецЕсли;
	
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьПараметрыРабочегоМеста(Место)
	
Возврат Место.АйПиАдрес;	
КонецФункции

&НаКлиенте		
Процедура Получить_ВГХ(ИмяКоманды,ВыходныеПараметры,ОтключитУстройство=Истина)
	РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	АйПиАдресс=ПолучитьПараметрыРабочегоМеста(РабочееМесто);
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки="";
		Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,ТекущееУстройство,ОписаниеОшибки);
		Если Результат Тогда
			ВходныеПараметры  = Новый Массив;
			ВходныеПараметры.Добавить(АйПиАдресс);
			ВыходныеПараметры = Неопределено;
			// выполним команду 
			Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ТекущееУстройство,ИмяКоманды,ВходныеПараметры,ВыходныеПараметры);
			Если Результат  Тогда
				РезультатКоманды=ВыходныеПараметры[0];
			Иначе
				ТекстСообщения = НСтр("ru='При получении ВГХ произошла ошибка."
						"Результат не получен."
						"Дополнительное описание:"
						"%ДополнительноеОписание%';uk='При получении ВГХ произошла ошибка."
						"Результат не получен."
						"Додатковий опис:"
						"%ДополнительноеОписание%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,
				                             "%ДополнительноеОписание%",
				                             ВыходныеПараметры[1]);
				РезультатКоманды=ТекстСообщения;							 
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			Если ОтключитУстройство Тогда
				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,ТекущееУстройство);
			КонецЕсли; 	
		КонецЕсли;																					  
	Иначе
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.';uk='Попередньо необхідно вибрати робоче місце зовнішнього обладнання поточного сеансу.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры
 
//==========Вынести в отдельную процедуру========
//
//Список аргументов зависит от контекста вызова!
&НаКлиенте
Процедура ВыполнениеКомандыЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура Получить_размерY(Команда)
	// Вставить содержимое обработчика.
	РезультатКоманды="";
	ИмяКоманды="outSizeY";
	ОтключитьУстройство=Истина;
	ВыходныеПараметры=Новый Массив;
	Получить_ВГХ(ИмяКоманды,ВыходныеПараметры,ОтключитьУстройство);
	Если НЕ ОтключитьУстройство Тогда
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Получить_размерZ(Команда)
	// Вставить содержимое обработчика.
	РезультатКоманды="";
	ИмяКоманды="outSizeZ";
	ОтключитьУстройство=Истина;
	ВыходныеПараметры=Новый Массив;
	Получить_ВГХ(ИмяКоманды,ВыходныеПараметры,ОтключитьУстройство);
	Если НЕ ОтключитьУстройство Тогда
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Получить_вес(Команда)
	// Вставить содержимое обработчика.
	РезультатКоманды="";
	ИмяКоманды="outVaga";
	ОтключитьУстройство=Истина;
	ВыходныеПараметры=Новый Массив;
	Получить_ВГХ(ИмяКоманды,ВыходныеПараметры,ОтключитьУстройство);
	Если НЕ ОтключитьУстройство Тогда
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Получить_Все(Команда)
	// Вставить содержимое обработчика.
	РезультатКоманды="";
	ИмяКоманды="outVarAll";
	ОтключитьУстройство=Истина;
	ВыходныеПараметры=Новый Массив;
	Получить_ВГХ(ИмяКоманды,ВыходныеПараметры,ОтключитьУстройство);
	Если НЕ ОтключитьУстройство Тогда
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура Получить_outVolume(Команда)
	// Вставить содержимое обработчика.  outVolume
	РезультатКоманды="";
	ИмяКоманды="outVolume";
	ОтключитьУстройство=Истина;
	ВыходныеПараметры=Новый Массив;
	Получить_ВГХ(ИмяКоманды,ВыходныеПараметры,ОтключитьУстройство);
	Если НЕ ОтключитьУстройство Тогда
		
	КонецЕсли;
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти



