
Функция ШаблонWeightsПолучитьРазмеры(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);	
	
	command = Запрос.ПараметрыURL["command"];
	
	СтрокаJSON = WeightsWeb.ПолучитьРазмер(command);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.ANSI);
	
	Возврат Ответ;
	
КонецФункции

Функция ШаблонPrintersПолучитьПринтеры(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON = PrintersWeb.ПолучитьПринтеры();
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.ANSI);
	Возврат Ответ;
КонецФункции

Функция ШаблонPrintersОтправитьКомандуНаПринтер(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON = PrintersWeb.ОтправитьПечатьНаПринтер("ТТН_Печать", "000068301", "Microsoft Print to PDF");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON,КодировкаТекста.ANSI);
	Возврат Ответ;
КонецФункции
