
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = МенеджерОборудованияВызовСервераПереопределяемый.ИспользоватьПодключаемоеОборудование();
	//Объект.ТекущееУстройство  = ПараметрыСеанса.РабочееМестоКлиента;
	//СписокЭлектронныхВесов = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам("ЭлектронныеВесы", , МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	//Если СписокЭлектронныхВесов.Количество() = 0 Тогда
	//	// Нет подключенных весов.
	//	Элементы.ЗапасыПолучитьВес.Видимость = Ложь;
	//КонецЕсли;
	//Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	// Конец ПодключаемоеОборудование
	//Вставить содержимое обработчика
	//СистемнаяИнформация = Новый СистемнаяИнформация();
	//ПараметрыРабочегоМеста     = МенеджерОборудованияВызовСервера.ПолучитьПараметрыРабочегоМеста(ВРег(СистемнаяИнформация.ИдентификаторКлиента));
	//Объект.ТекущееРабочееМесто = ПараметрыРабочегоМеста.ТекущееРабочееМесто;
	//Объект.ТекущееУстройство   = ПараметрыРабочегоМеста.Устройство_ВГХ;
	//Объект.ТекущееРабочееМесто=ПараметрыСеанса.РабочееМестоКлиента;
	//ТекущееРабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	//Объект.ТекущееУстройство  = Объект.ТекущееРабочееМесто.Устройство_ВГХ;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода, УстройствоВГХ");
	// Конец ПодключаемоеОборудование

	//Место=ТекущееРабочееМесто;
	//ЕстьРабочееМесто = МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	//Если ЕстьРабочееМесто Тогда
	//	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода,ЭлектронныеВесы,УстройствоВГХ");
	//	ПодключенноеУстройство = МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Устройство.Ссылка)
	//	//ОткрытьФорму("Обработка.ТестированиеПодключаемогоОборудования.Форма", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	//	//Объект.ТекущееРабочееМесто=ПараметрыСеанса.РабочееМестоКлиента;
	//	//ТекущееУстройство  = Объект.ТекущееРабочееМесто.Устройство_ВГХ;
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'"));
	//КонецЕсли;
	хх=глПодключаемоеОборудование;
	ЕстьРабочееМесто = МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	//Если ЕстьРабочееМесто Тогда
		МенеджерОборудованияКлиент.НачатьПодключениеОборудования(Неопределено, ЭтотОбъект, Новый Структура("СканерШтрихкода,ЭлектронныеВесы,УстройствоВГХ"));
	//	ПодключенноеУстройство = МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, УникальныйИдентификатор)
	//Иначе
	//	ПоказатьПредупреждение(,"На рабочем месте Нет ни одного подключенного устройства.");
	//	Отказ=Истина;
	//	возврат;
	//КонецЕсли;
	
	Если НЕ ХХ.ПараметрыПодключенияПО.Количество()=0 Тогда
		//КонецЕсли; 
		Объект.ТекущееРабочееМесто=   глПодключаемоеОборудование.ПараметрыПодключенияПО[0].РабочееМесто;
		Объект.ТекущееУстройство  =   глПодключаемоеОборудование.ПараметрыПодключенияПО[0].Ссылка;
		
		Для каждого ЭлементМассива Из глПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
			Элементы.ЛокальноеОборудование.СписокВыбора.Добавить(ЭлементМассива.Ссылка);
		КонецЦикла;
		ЛокальноеОборудование=глПодключаемоеОборудование.ПараметрыПодключенияПО[0].Ссылка;
		ТекущееУстройствоПриИзмененииНаСервере()
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбора(ВыбЗнач, Параметры) Экспорт
    Если ВыбЗнач<>Неопределено Тогда
        // обработка введенного значения
		Объект.ТекущееУстройство = ВыбЗнач;
		УстановитьЗначениеПараметраСеанса("ТекущееУстройство",ВыбЗнач) ;
		ТекущееУстройствоПриИзмененииНаСервере()
	Иначе
		
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра,ЗначениеПараметра)

ПараметрыСеанса[ИмяПараметра]=ЗначениеПараметра	;

КонецПроцедуры



&НаКлиенте
Процедура СоздатьНовый(Команда)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(Объект.ТекущееУстройство) Тогда
		////откоем форму нового документа с параметром ТекущееУстройство
		ПараметрыФормы=Новый Структура;
		ПараметрыФормы.Вставить("ТекущееУстройство",Объект.ТекущееУстройство);
		ПараметрыФормы.Вставить("ТекущееРабочееМесто",Объект.ТекущееРабочееМесто);
	    ОткрытьФорму("Документ.ОтгрузкаПоЗаказу.ФормаОбъекта",ПараметрыФормы,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		// выбор устройства 
		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ТекущееУстройствоПриИзмененииНаСервере()
	// Вставить содержимое обработчика. 
	если ЗначениеЗаполнено(Объект.ТекущееУстройство) Тогда
		Справочники.ПодключаемоеОборудование.ВыбраноУстройство(Объект.ТекущееУстройство );
		//ПараметрыСеанса.ТекущееУстройство= Объект.ТекущееУстройство;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекущееУстройствоПриИзменении(Элемент)
		ТекущееУстройствоПриИзмененииНаСервере();
КонецПроцедуры





&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	хх=1;
КонецПроцедуры
