
Функция ТестУстройства(ОбъектДрайвера, РезультатТеста, АктивированДемоРежим, Параметры) Экспорт
	
	Результат = Подключить(ОбъектДрайвера, Параметры);

	// Дополнительные действия по проверке устройства

	Если НЕ Результат Тогда
		ПолучитьОшибку(ОбъектДрайвера, РезультатТеста);
	КонецЕсли;
	
	Отключить(ОбъектДрайвера);

	Возврат Результат;
	
КонецФункции
Функция ПолучитьДополнительныеДействия(ОбъектДрайвера, ДополнительныеДействия) Экспорт
	
	ДополнительныеДействия = "";
	
	Возврат Истина;
	
КонецФункции
Функция ПолучитьНомерВерсии(ОбъектДрайвера) Экспорт
	Возврат "1.0";
КонецФункции
Функция Подключить(ОбъектДрайвера, Параметры) Экспорт
	
	Перем IP, ПортIP, ТипСоединения;
	Перем adrServ,portServ,portClient,timeRecvWait_x10ms;
	Перем Порт, Скорость, Модель;
	
	Параметры.Свойство("Интерфейс", ТипСоединения);
	Параметры.Свойство("IP", IP);
	Параметры.Свойство("ПортIP", ПортIP);
	Параметры.Свойство("Порт", Порт);
	Параметры.Свойство("Скорость", Скорость);
	Параметры.Свойство("Модель", Модель);
	//Параметры.Свойство("Модель", "*");
	
	Параметры.Свойство("adrServ",adrServ );
	Параметры.Свойство("portServ",portServ );
	Параметры.Свойство("portClient",portClient );
	Параметры.Свойство("timeRecvWait_x10ms",timeRecvWait_x10ms );
	
	Результат = Истина;
	
	//ТипМодели = ?(Лев(Модель,1)="*", 100, Число(Лев(Модель,1)));
	
	// Проверка параметров
	МодельНаTCPIP = (ТипСоединения=1);	
	УсловиеОшибкиПодключения = ?(МодельНаTCPIP, IP = Неопределено Или ПортIP = Неопределено, Порт = Неопределено Или Скорость = Неопределено);
	УсловиеОшибкиПодключения = ?(МодельНаTCPIP, adrServ = Неопределено Или portServ = Неопределено, portClient = Неопределено );
	
	Если УсловиеОшибкиПодключения Тогда
		Результат = Ложь;
	Иначе
		// Начало работы с  драйвером 
		txtOUT = ОбъектДрайвера.GetIndex(1);
		Если  найти(txtOut,"Error") тогда
			Возврат Ложь;
		КонецЕсли;
		//Успешно = ОбъектДрайвера.start(ТипМодели);
		//Если НЕ Успешно Тогда
		//	// Завершение работы с универсальным драйвером АртСофт
		//	ОбъектДрайвера.stop();
		//КонецЕсли;
		
		// Открытие СОМ-порта или TCP/IP и соединение с регистратором
		//Успешно = ?(МодельНаTCPIP, ОбъектДрайвера.openPortEx(IP,ПортIP), ОбъектДрайвера.openPort(Порт,Скорость));
		//Если НЕ Успешно Тогда
		//	ОбъектДрайвера.closePort();
		//	Результат = Ложь;
		//КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
Функция ПолучитьПараметры(ОбъектДрайвера, ТаблицаПараметров) Экспорт
	
	ТаблицаПараметров = "";
	
	Возврат Истина;
	
КонецФункции
Функция ПолучитьОшибку(ОбъектДрайвера, ОписаниеОшибки) Экспорт
	ОписаниеОшибки="?????????????????????????????";
	Возврат "Ошибка обращения к устройству";
	ОписаниеОшибки = ОбъектДрайвера.LastErrorExText;
	Возврат ОбъектДрайвера.LastError;
	
КонецФункции
Функция ПолучитьОписание(ОбъектДрайвера, Наименование, Описание, ТипОборудования, РевизияИнтерфейса, ИнтеграционнаяБиблиотека, ОсновнойДрайверУстановлен, ПолучитьURLCкачивания) Экспорт
	Наименование = "АртСофт: Универсальный драйвер фискальных регистраторов";
	Описание = "OLE-сервер ArtSoft Универсальный драйвер РРО – предназначена для работы прикладных программ с украинскими фискальными регистраторами в операционных системах MS Windows";
	ТипОборудования = "ФискальныйРегистратор";
	ИнтеграционнаяБиблиотека = "ArtSoftFiscalPrinter.dll";
	РевизияИнтерфейса = "1.0";
	ОсновнойДрайверУстановлен = Истина;
	ПолучитьURLCкачивания = "www.artsoft.ua/download/ArtSoftFiscalPrinter.rar";
КонецФункции
Функция Отключить(ОбъектДрайвера) Экспорт
	
	// Отключение устройства.
	//ОбъектДрайвера.closePort();
	//ОбъектДрайвера.stop();
	
КонецФункции

Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
                         ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт

хх=1;	

КонецФункции // ()
