Функция ПолучитьПараметрыАктивногоСайта()  Экспорт
Параметры=Новый Структура("Наименование,HTTPСервер,ИмяПользователя,Пароль,GUID,Порт");
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ОбменсМаркетПлейсом.Ссылка КАК Ссылка,
|	ОбменсМаркетПлейсом.Наименование КАК Наименование,
|	ОбменсМаркетПлейсом.АдресСайта КАК HTTPСервер,
|	ОбменсМаркетПлейсом.ИмяПользователя КАК ИмяПользователя,
|	ОбменсМаркетПлейсом.Пароль КАК Пароль,
|	ОбменсМаркетПлейсом.Токен КАК GUID,
|	ОбменсМаркетПлейсом.СайтПодключен КАК СайтПодключен,
|	0 КАК Порт
|ИЗ
|	ПланОбмена.ОбменсМаркетПлейсом КАК ОбменсМаркетПлейсом
|ГДЕ
|	ОбменсМаркетПлейсом.СайтПодключен
|	И НЕ ОбменсМаркетПлейсом.ПометкаУдаления";

РезультатЗапроса = Запрос.Выполнить();
Если РезультатЗапроса.Пустой() Тогда
	Возврат Параметры;
КонецЕсли; 
Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
	ЗаполнитьЗначенияСвойств(Параметры,Выборка);
	Параметры.Вставить("Пароль",ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Выборка.Ссылка, "Пароль"));
	Прервать;
КонецЦикла;
Возврат Параметры;	

	
КонецФункции
