
// Формирует уникальное наименование объекта
//
// Параметры:
// нет
// 
// Возвращаемое значение:
// нет
//
Процедура СформироватьНаименование() Экспорт
	Префикс="ВГХ";
	//Если ОбменТоварами И ОбменЗаказами Тогда
	//	
	//	Префикс = НСтр("ru='Обмен товарами и заказами';uk='Обмін товарами й замовленнями'");
	//	
	//ИначеЕсли ОбменЗаказами Тогда
	//	
	//	Префикс = НСтр("ru='Обмен заказами';uk='Обмін замовленнями'");
	//	
	//Иначе
	//	
	//	Префикс = НСтр("ru='Выгрузка товаров';uk='Вивантаження товарів'");
	//	
	//КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ОбменУправлениеНебольшойФирмойСайт.Наименование) КАК Наименование
	|ИЗ
	|	ПланОбмена.ОбменУправлениеНебольшойФирмойСайт КАК ОбменУправлениеНебольшойФирмойСайт
	|ГДЕ
	|	ОбменУправлениеНебольшойФирмойСайт.Наименование ПОДОБНО &Шаблон
	|
	|ИМЕЮЩИЕ
	|	(НЕ МАКСИМУМ(ОбменУправлениеНебольшойФирмойСайт.Наименование) ЕСТЬ NULL )";
	
	Запрос.УстановитьПараметр("Шаблон", Префикс + "%");
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Наименование = Префикс;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Суффикс = Прав(СокрЛП(Выборка.Наименование), 4);
	
	Попытка
		СуффиксЧислом = Число(Суффикс);
	Исключение
		Наименование = Префикс + " 0001";
		Возврат;
	КонецПопытки;
	
	Наименование = Префикс + " " + Формат(СуффиксЧислом + 1, "ЧЦ=4; ЧВН=; ЧГ=");
	
КонецПроцедуры




#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты)
	
	//Если ВыгружатьНаСайт Тогда
		
		ПроверяемыеРеквизиты.Добавить("АдресСайта");
		ПроверяемыеРеквизиты.Добавить("ИмяПользователя");
		
	//Иначе
	//	
	//	ПроверяемыеРеквизиты.Добавить("КаталогВыгрузки");
	//	
	//КонецЕсли;

	//Если ОбменЗаказами Тогда
	//	
	//	Если НЕ ВыгружатьНаСайт Тогда
	//		ПроверяемыеРеквизиты.Добавить("ФайлЗагрузки");
	//	КонецЕсли;
	//	
	//	ПроверяемыеРеквизиты.Добавить("СпособИдентификацииКонтрагентов");
	//	
	//	Если СпособИдентификацииКонтрагентов = Перечисления.СпособыИдентификацииКонтрагентов.ПредопределенноеЗначение Тогда
	//		ПроверяемыеРеквизиты.Добавить("КонтрагентДляПодстановкиВЗаказы");
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
