// Возвращает данные первой записи результата запроса в виде структуры.
// 
// Параметры:
//  РезультатЗапроса - РезультатЗапроса - Результат запроса, содержащий данные для обработки.
// 
// Возвращаемое значение:
//  Структура - структура с результатом.
//
Функция РезультатЗапросаВСтруктуру(Знач РезультатЗапроса) Экспорт
	
	Результат = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
КонецФункции

//////////////////////////////////////////////////////////////////////////
// === Сообщить
Процедура вгЗаписьВЖурнал(Сайт, Текст, Уровень, ЭтоОшибка = Ложь)  Экспорт 
	
	ЗаписатьВЖурнал = (Уровень = Перечисления.стУровниЖурналирования.Минимальный) И 
					(Не Сайт.Журналирования = Перечисления.стУровниЖурналирования.БезЖурнала);
					
	УровеньЖурнала = ?(ЭтоОшибка, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);			
	
	Если ЗаписатьВЖурнал Тогда
		ЗаписьЖурналаРегистрации("ОбменССайтом", 
		        УровеньЖурнала,
		        Метаданные.Справочники.стСайты,
		        Сайт,
		        Текст);
	КонецЕсли;
	
КонецПроцедуры
