
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Параметры.Свойство("Идентификатор", Идентификатор);
	Параметры.Свойство("ДрайверОборудования", ДрайверОборудования);
	
	Заголовок = НСтр("ru='Оборудование:';uk='Устаткування:'") + Символы.НПП  + Строка(Идентификатор);
	
	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;

	СписокПорт = Элементы.Порт.СписокВыбора;
	Для Номер = 1 По 64 Цикл
		СписокПорт.Добавить(Номер, "COM" + Формат(Номер, "ЧЦ=2; ЧДЦ=0; ЧН=0; ЧГ=0"));
	КонецЦикла;  
	
	СписокИнтерфейс = Элементы.Интерфейс.СписокВыбора;
	СписокИнтерфейс.Добавить(0, "Ethernet");
	СписокИнтерфейс.Добавить(1, "RS-232");

    СписокСкорость = Элементы.Скорость.СписокВыбора; 
	СписокСкорость.Добавить(0,  "2400");
	СписокСкорость.Добавить(1,  "4800");
	СписокСкорость.Добавить(2,  "9600");
	СписокСкорость.Добавить(3, "19200");
	СписокСкорость.Добавить(4, "38400");
	СписокСкорость.Добавить(5, "57600");
	СписокСкорость.Добавить(6,"115200");
	
	времНаименование        = Неопределено;
	времИнтерфейс           = Неопределено;
	времПорт                = Неопределено;
	времСкорость            = Неопределено;
	времТаймаут             = Неопределено;
	времIPАдрес             = Неопределено;
	времUDPПортПолучателя   = Неопределено;
	времUDPТаймаут          = Неопределено;
	
	// Устройство ВГХ
	времadrServ             = Неопределено;
	времportServ            = Неопределено;
	времportClient          = Неопределено;
	времtimeRecvWait_x10ms  = Неопределено;
	// Конец Устройство ВГХ
	
	времПароль              = Неопределено;
	времБыстраяЗагрузка     = Неопределено;
	
	Параметры.ПараметрыОборудования.Свойство("Интерфейс"        , времИнтерфейс);
	Параметры.ПараметрыОборудования.Свойство("Порт"             , времПорт);
	Параметры.ПараметрыОборудования.Свойство("Скорость"         , времСкорость);
	Параметры.ПараметрыОборудования.Свойство("Таймаут"          , времТаймаут);
	
	Параметры.ПараметрыОборудования.Свойство("IPАдрес"          , времIPАдрес);
	Параметры.ПараметрыОборудования.Свойство("UDPПортПолучателя", времUDPПортПолучателя);
	Параметры.ПараметрыОборудования.Свойство("UDPТаймаут"       , времUDPТаймаут);
	// Устройство ВГХ
	Параметры.ПараметрыОборудования.Свойство("adrServ"              , времadrServ);
	Параметры.ПараметрыОборудования.Свойство("portServ"             , времportServ);
	Параметры.ПараметрыОборудования.Свойство("portClient"           , времportClient);
	Параметры.ПараметрыОборудования.Свойство("timeRecvWait_x10ms"   , времtimeRecvWait_x10ms);
	// Конец Устройство ВГХ
	Параметры.ПараметрыОборудования.Свойство("Пароль"           , времПароль);
	Параметры.ПараметрыОборудования.Свойство("БыстраяЗагрузка"  , времБыстраяЗагрузка);
	Параметры.ПараметрыОборудования.Свойство("Наименование"     , времНаименование);
	                          
	Интерфейс          = ?(времИнтерфейс           = Неопределено, 1, времИнтерфейс);
	Порт               = ?(времПорт                = Неопределено, 1, времПорт);
	Скорость           = ?(времСкорость            = Неопределено, 2, времСкорость);
	Таймаут            = ?(времТаймаут             = Неопределено, 50, времТаймаут);
	IPАдрес            = ?(времIPАдрес             = Неопределено, "192.168.0.1", времIPАдрес);
	UDPПортПолучателя  = ?(времUDPПортПолучателя   = Неопределено, 1111, времUDPПортПолучателя);
	UDPТаймаут         = ?(времUDPТаймаут          = Неопределено, 500, времUDPТаймаут);
	Пароль             = ?(времПароль              = Неопределено, "0030", времПароль);
	БыстраяЗагрузка    = ?(времБыстраяЗагрузка     = Неопределено, Ложь, времБыстраяЗагрузка);
	// Устройство ВГХ
	adrServ            = ?(времadrServ             = Неопределено, "192.168.0.1",времadrServ );
	portServ           = ?(времportServ            = Неопределено, "10357", времportServ);
	portClient         = ?(времportClient          = Неопределено, "10257",времportClient );
	timeRecvWait_x10ms = ?(времtimeRecvWait_x10ms  = Неопределено, 500, времtimeRecvWait_x10ms);
	// Конец Устройство ВГХ

	Наименование = ?(времНаименование = Неопределено, НСтр("ru='Устройство ВГХ';uk='Устройство ВГХ'"), времНаименование);
	Элементы.ТестУстройства.Видимость    = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	//Элементы.УстановитьДрайвер.Видимость = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто); 
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	НовыеЗначениеПараметров = Новый Структура;
	НовыеЗначениеПараметров.Вставить("Интерфейс"   , Интерфейс);
	
	НовыеЗначениеПараметров.Вставить("IPАдрес"              , adrClient);
	НовыеЗначениеПараметров.Вставить("adrServ"              , adrServ);
	НовыеЗначениеПараметров.Вставить("portServ"             , portServ);
	НовыеЗначениеПараметров.Вставить("portClient"           , portClient);
	НовыеЗначениеПараметров.Вставить("timeRecvWait_x10ms"   , timeRecvWait_x10ms);
	
	НовыеЗначениеПараметров.Вставить("IP"              , IP);
	НовыеЗначениеПараметров.Вставить("ПортIP"          , ПортIP);
	НовыеЗначениеПараметров.Вставить("Порт"            , Порт);
	НовыеЗначениеПараметров.Вставить("Скорость"        , Скорость);
	НовыеЗначениеПараметров.Вставить("Модель"          , Модель);
	//НовыеЗначениеПараметров.Вставить("ТаблицаСоответствийНалоговыхГрупп" , ПолучитьПараметрыИзТаблицыСоответствий());
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	РезультатТеста = Неопределено;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Интерфейс"    		, Интерфейс);
	времПараметрыУстройства.Вставить("Порт"     	 		, Порт);
	времПараметрыУстройства.Вставить("Скорость" 	  		, Скорость);
	времПараметрыУстройства.Вставить("Таймаут"				, Таймаут);	
	времПараметрыУстройства.Вставить("IPАдрес"				, IPАдрес);
	времПараметрыУстройства.Вставить("UDPПортПолучателя"	, UDPПортПолучателя);
	времПараметрыУстройства.Вставить("UDPТаймаут"      		, UDPТаймаут);
	
	времПараметрыУстройства.Вставить("adrServ"              , adrServ);
	времПараметрыУстройства.Вставить("portServ"             , portServ);
	времПараметрыУстройства.Вставить("portClient"           , portClient);
	времПараметрыУстройства.Вставить("timeRecvWait_x10ms"   , timeRecvWait_x10ms);
	
	
	времПараметрыУстройства.Вставить("Пароль"				, Пароль);
	времПараметрыУстройства.Вставить("Наименование"			, Наименование);
	//времПараметрыУстройства.Вставить("БыстраяЗагрузка"		, БыстраяЗагрузка);

	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("CheckHealth",
	                                                                      ВходныеПараметры,
	                                                                      ВыходныеПараметры,
	                                                                      Идентификатор,
	                                                                      времПараметрыУстройства);

	Если Результат Тогда
		ТекстСообщения = НСтр("ru='Тест успешно выполнен.';uk='Тест успішно виконаний.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ДополнительноеОписание = ?(ТипЗнч(ВыходныеПараметры) = Тип("Массив")
		                           И ВыходныеПараметры.Количество() >= 2,
		                           НСтр("ru='Дополнительное описание:';uk='Додатковий опис:'") + " " + ВыходныеПараметры[1],
		                           "");


		ТекстСообщения = НСтр("ru='Тест не пройден.%ПереводСтроки%%ДополнительноеОписание%';uk='Тест не пройдено.%ПереводСтроки%%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ИнтерфейсПриИзменении(Элемент)
	
	ПроверкаДоступности();
	
КонецПроцедуры
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверкаДоступности()

	Элементы.Порт.Доступность          		= (Интерфейс = 1);
	Элементы.Скорость.Доступность      		= (Интерфейс = 1);
	Элементы.Таймаут.Доступность      		= (Интерфейс = 1);
	Элементы.IPАдрес.Доступность       		= Не (Интерфейс = 1);
	Элементы.UDPПортПолучателя.Доступность  = Не (Интерфейс = 1);
	Элементы.UDPТаймаут.Доступность         = Не (Интерфейс = 1);
           
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Интерфейс"    		, Интерфейс);
	времПараметрыУстройства.Вставить("Порт"     	 		, Порт);
	времПараметрыУстройства.Вставить("Скорость" 	  		, Скорость);
	времПараметрыУстройства.Вставить("Таймаут"				, Таймаут);	
	времПараметрыУстройства.Вставить("IPАдрес"				, IPАдрес);
	времПараметрыУстройства.Вставить("UDPПортПолучателя"	, UDPПортПолучателя);
	времПараметрыУстройства.Вставить("UDPТаймаут"      		, UDPТаймаут);
	
	времПараметрыУстройства.Вставить("adrServ"              , adrServ);
	времПараметрыУстройства.Вставить("portServ"             , portServ);
	времПараметрыУстройства.Вставить("portClient"           , portClient);
	времПараметрыУстройства.Вставить("timeRecvWait_x10ms"   , timeRecvWait_x10ms);
	
	времПараметрыУстройства.Вставить("Пароль"				, Пароль);
	времПараметрыУстройства.Вставить("Наименование"			, Наименование);
	времПараметрыУстройства.Вставить("БыстраяЗагрузка"		, БыстраяЗагрузка);
	
	Если МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства) Тогда
		Драйвер = ВыходныеПараметры[0];
		Версия  = ВыходныеПараметры[1];
	Иначе
		Драйвер = ВыходныеПараметры[2];
		Версия  = НСтр("ru='Не определена';uk='Не визначена'");
	КонецЕсли;

	Элементы.Драйвер.ЦветТекста = ?(Драйвер = НСтр("ru='Не установлен';uk='Не встановлений'"), ЦветОшибки, ЦветТекста);
	Элементы.Версия.ЦветТекста  = ?(Версия  = НСтр("ru='Не определена';uk='Не визначена'"), ЦветОшибки, ЦветТекста);

	//Элементы.УстановитьДрайвер.Доступность = Не (Драйвер = НСтр("ru='Установлен';uk='Встановлений'"));

	ПроверкаДоступности();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства_2(Команда)
	ПараметрыФорма= Новый Структура;
	ПараметрыФорма.Вставить("Устройство",Идентификатор);
	
	ОткрытьФорму("Обработка.ТестированиеПодключенияУстройствВГХ_УФ.Форма",ПараметрыФорма,ЭтотОбъект,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти