Процедура СохранитьРеестр(СтруктураРеестр) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеестрОтгрузок.Ссылка
		|ИЗ
		|	Документ.РеестрОтгрузок КАК РеестрОтгрузок
		|ГДЕ
		|	РеестрОтгрузок.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", СтруктураРеестр.reestr_number);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		ОбъектДокумента = СоздатьДокумент();
		ОбъектДокумента.ВнешняяСсылка = СтруктураРеестр.reestr_ref;
		ОбъектДокумента.Дата = Дата(СтруктураРеестр.reestr_date);
		ОбъектДокумента.Номер = СтруктураРеестр.reestr_number;
		
	КонецЕсли;
	
	ОбъектДокумента.Напечатан = СтруктураРеестр.reestr_printing;
	ОбъектДокумента.Записать();

КонецПроцедуры